In [1]:
import pandas as pd
Employee = {
    "First": ["vishnu", "siva", "madhu"],
    "Last": ["Chegondi", "Prasad", "Vasanth"],
    "email": ["vishnu.chegondi@email.com","siva.prasad@email.com","madhu.vasanth@email.com"]
}
employee_df = pd.DataFrame(Employee)

In [2]:
employee_df.rename(columns={"First":"first_name"}, inplace=True)

In [3]:
employee_df.columns = employee_df.columns.str.replace('_',' ')
employee_df.columns = [x.upper() for x in employee_df.columns]
employee_df

  FIRST NAME      LAST                      EMAIL
0     vishnu  Chegondi  vishnu.chegondi@email.com
1       siva    Prasad      siva.prasad@email.com
2      madhu   Vasanth    madhu.vasanth@email.com

In [4]:
employee_df.columns = ['FirstName','LastName','Email']
employee_df

  FirstName  LastName                      Email
0    vishnu  Chegondi  vishnu.chegondi@email.com
1      siva    Prasad      siva.prasad@email.com
2     madhu   Vasanth    madhu.vasanth@email.com